app/controllers/carts_controller.rb

SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = $1 AND "carts"."purchased" = $2  [["user_id", 1], ["purchased", false]]
SELECT "products".* FROM "products" WHERE "products"."id" IN ($1, $2)  [["id", 1], ["id", 2]]
---
  def index
    @carts = Cart.includes(:product).where(user_id: current_user.id, purchased: false)

SELECT  "carts".* FROM "carts" WHERE "carts"."product_id" = $1 AND "carts"."purchased" = $2 LIMIT $3  [["product_id", 1], ["purchased", false], ["LIMIT", 1]]
INSERT INTO "carts" ("user_id", "product_id", "quantity", "total_price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 2], ["product_id", 2], ["quantity", 1], ["total_price", "30.0"], ["created_at", "2019-04-25 18:54:21.221404"], ["updated_at", "2019-04-25 18:54:21.221404"]]
UPDATE "carts" SET "quantity" = $1, "total_price" = $2, "updated_at" = $3 WHERE "carts"."id" = $4  [["quantity", 2], ["total_price", "60.0"], ["updated_at", "2019-04-25 19:02:59.662704"], ["id", 1]]
---
  def create
    @cart = Cart.find_by(product_id: cart_params[:product_id], purchased: false)
    if @cart.present?
      @cart.quantity += 1
      @cart.total_price += cart_params[:total_price].to_f
    else
      @cart = Cart.new(cart_params)
      @cart.user_id = current_user.id
      @cart.quantity = 1
    end
    if @cart.save