app/controllers/products_controller.rb

SELECT  "products".* FROM "products" ORDER BY id ASC LIMIT $1 OFFSET $2  [["LIMIT", 12], ["OFFSET", 0]]
SELECT COUNT(*) FROM "products"
---
  def index
    @products = Product.paginate(page: params[:page], per_page: 12).order('id ASC')

INSERT INTO "products" ("name", "details", "price", "stock", "image_path", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "P1"], ["details", "sa"], ["price", "12.0"], ["stock", 100], ["image_path", ""], ["created_at", "2019-04-24 19:28:40.986658"], ["updated_at", "2019-04-24 19:28:40.986658"]]
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save